__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 256, 256, 3) 0                                            
__________________________________________________________________________________________________
lambda (Lambda)                 (None, 256, 256, 3)  0           input_2[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 256, 256, 32) 896         lambda[0][0]                     
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 256, 256, 32) 128         conv2d_1[0][0]                   
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 256, 256, 32) 0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
dropout (Dropout)               (None, 256, 256, 32) 0           activation_1[0][0]               
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 256, 256, 32) 9248        dropout[0][0]                    
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 128, 128, 32) 0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 128, 128, 64) 18496       max_pooling2d[0][0]              
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 128, 128, 64) 256         conv2d_4[0][0]                   
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 128, 128, 64) 0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 128, 128, 64) 0           activation_3[0][0]               
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 128, 128, 64) 36928       dropout_1[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 64, 64, 64)   0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 64, 64, 128)  73856       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 64, 64, 128)  512         conv2d_7[0][0]                   
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 64, 64, 128)  0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 64, 64, 128)  0           activation_5[0][0]               
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 64, 64, 128)  147584      dropout_2[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 32, 32, 128)  0           conv2d_8[0][0]                   
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 32, 32, 256)  295168      max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 32, 32, 256)  1024        conv2d_10[0][0]                  
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 32, 32, 256)  0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 32, 32, 256)  0           activation_7[0][0]               
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 32, 32, 256)  590080      dropout_3[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 16, 16, 256)  0           conv2d_11[0][0]                  
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 16, 16, 512)  1180160     max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 16, 16, 512)  2048        conv2d_13[0][0]                  
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 16, 16, 512)  0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 16, 16, 512)  0           activation_9[0][0]               
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 16, 16, 512)  2359808     dropout_4[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 8, 8, 512)    0           conv2d_14[0][0]                  
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 8, 8, 1024)   4719616     max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 8, 8, 1024)   4096        conv2d_16[0][0]                  
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 8, 8, 1024)   0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 8, 8, 1024)   0           activation_11[0][0]              
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 8, 8, 1024)   9438208     dropout_5[0][0]                  
__________________________________________________________________________________________________
conv2d_transpose (Conv2DTranspo (None, 16, 16, 512)  2097664     conv2d_17[0][0]                  
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 16, 16, 1024) 0           conv2d_transpose[0][0]           
                                                                 conv2d_14[0][0]                  
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 16, 16, 512)  4719104     concatenate[0][0]                
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 16, 16, 512)  2048        conv2d_19[0][0]                  
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 16, 16, 512)  0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 16, 16, 512)  0           activation_13[0][0]              
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 16, 16, 512)  2359808     dropout_6[0][0]                  
__________________________________________________________________________________________________
conv2d_transpose_1 (Conv2DTrans (None, 32, 32, 256)  524544      conv2d_20[0][0]                  
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 32, 32, 512)  0           conv2d_transpose_1[0][0]         
                                                                 conv2d_11[0][0]                  
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 32, 32, 256)  1179904     concatenate_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 32, 32, 256)  1024        conv2d_22[0][0]                  
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 32, 32, 256)  0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
dropout_7 (Dropout)             (None, 32, 32, 256)  0           activation_15[0][0]              
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 32, 32, 256)  590080      dropout_7[0][0]                  
__________________________________________________________________________________________________
conv2d_transpose_2 (Conv2DTrans (None, 64, 64, 128)  131200      conv2d_23[0][0]                  
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 64, 64, 256)  0           conv2d_transpose_2[0][0]         
                                                                 conv2d_8[0][0]                   
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 64, 64, 128)  295040      concatenate_2[0][0]              
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 64, 64, 128)  512         conv2d_25[0][0]                  
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 64, 64, 128)  0           batch_normalization_17[0][0]     
__________________________________________________________________________________________________
dropout_8 (Dropout)             (None, 64, 64, 128)  0           activation_17[0][0]              
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 64, 64, 128)  147584      dropout_8[0][0]                  
__________________________________________________________________________________________________
conv2d_transpose_3 (Conv2DTrans (None, 128, 128, 64) 32832       conv2d_26[0][0]                  
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 128, 128, 128 0           conv2d_transpose_3[0][0]         
                                                                 conv2d_5[0][0]                   
__________________________________________________________________________________________________
conv2d_28 (Conv2D)              (None, 128, 128, 64) 73792       concatenate_3[0][0]              
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 128, 128, 64) 256         conv2d_28[0][0]                  
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 128, 128, 64) 0           batch_normalization_19[0][0]     
__________________________________________________________________________________________________
dropout_9 (Dropout)             (None, 128, 128, 64) 0           activation_19[0][0]              
__________________________________________________________________________________________________
conv2d_29 (Conv2D)              (None, 128, 128, 64) 36928       dropout_9[0][0]                  
__________________________________________________________________________________________________
conv2d_transpose_4 (Conv2DTrans (None, 256, 256, 32) 8224        conv2d_29[0][0]                  
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 256, 256, 64) 0           conv2d_transpose_4[0][0]         
                                                                 conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_31 (Conv2D)              (None, 256, 256, 32) 18464       concatenate_4[0][0]              
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 256, 256, 32) 128         conv2d_31[0][0]                  
__________________________________________________________________________________________________
activation_21 (Activation)      (None, 256, 256, 32) 0           batch_normalization_21[0][0]     
__________________________________________________________________________________________________
dropout_10 (Dropout)            (None, 256, 256, 32) 0           activation_21[0][0]              
__________________________________________________________________________________________________
conv2d_32 (Conv2D)              (None, 256, 256, 32) 9248        dropout_10[0][0]                 
__________________________________________________________________________________________________
conv2d_33 (Conv2D)              (None, 256, 256, 1)  33          conv2d_32[0][0]                  
==================================================================================================
Total params: 31,106,529
Trainable params: 31,100,513
Non-trainable params: 6,016
__________________________________________________________________________________________________