__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 256, 256, 3) 0                                            
__________________________________________________________________________________________________
block1_conv1 (Conv2D)           (None, 256, 256, 64) 1792        input_2[0][0]                    
__________________________________________________________________________________________________
block1_conv2 (Conv2D)           (None, 256, 256, 64) 36928       block1_conv1[0][0]               
__________________________________________________________________________________________________
block1_pool (MaxPooling2D)      (None, 128, 128, 64) 0           block1_conv2[1][0]               
__________________________________________________________________________________________________
block2_conv1 (Conv2D)           (None, 128, 128, 128 73856       block1_pool[1][0]                
__________________________________________________________________________________________________
block2_conv2 (Conv2D)           (None, 128, 128, 128 147584      block2_conv1[1][0]               
__________________________________________________________________________________________________
block2_pool (MaxPooling2D)      (None, 64, 64, 128)  0           block2_conv2[1][0]               
                                                                 dropout_1[0][0]                  
__________________________________________________________________________________________________
block3_conv1 (Conv2D)           (None, 64, 64, 256)  295168      block2_pool[1][0]                
                                                                 block2_pool[2][0]                
__________________________________________________________________________________________________
block3_conv2 (Conv2D)           (None, 64, 64, 256)  590080      block3_conv1[1][0]               
                                                                 block3_conv1[2][0]               
__________________________________________________________________________________________________
block3_conv3 (Conv2D)           (None, 64, 64, 256)  590080      block3_conv2[1][0]               
                                                                 block3_conv2[2][0]               
__________________________________________________________________________________________________
block3_conv4 (Conv2D)           (None, 64, 64, 256)  590080      block3_conv3[1][0]               
                                                                 block3_conv3[2][0]               
__________________________________________________________________________________________________
block3_pool (MaxPooling2D)      (None, 32, 32, 256)  0           block3_conv4[1][0]               
                                                                 block3_conv4[2][0]               
__________________________________________________________________________________________________
block4_conv1 (Conv2D)           (None, 32, 32, 512)  1180160     block3_pool[1][0]                
                                                                 block3_pool[2][0]                
__________________________________________________________________________________________________
block4_conv2 (Conv2D)           (None, 32, 32, 512)  2359808     block4_conv1[1][0]               
                                                                 block4_conv1[2][0]               
__________________________________________________________________________________________________
block4_conv3 (Conv2D)           (None, 32, 32, 512)  2359808     block4_conv2[1][0]               
                                                                 block4_conv2[2][0]               
__________________________________________________________________________________________________
block4_conv4 (Conv2D)           (None, 32, 32, 512)  2359808     block4_conv3[1][0]               
                                                                 block4_conv3[2][0]               
__________________________________________________________________________________________________
conv2d_transpose (Conv2DTranspo (None, 64, 64, 256)  524544      block4_conv4[1][0]               
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 64, 64, 512)  0           conv2d_transpose[0][0]           
                                                                 block3_conv4[1][0]               
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 64, 64, 256)  1179904     concatenate[0][0]                
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 64, 64, 256)  1024        conv2d[0][0]                     
__________________________________________________________________________________________________
activation (Activation)         (None, 64, 64, 256)  0           batch_normalization[0][0]        
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 64, 64, 256)  590080      activation[0][0]                 
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 64, 64, 256)  1024        conv2d_1[0][0]                   
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 64, 64, 256)  0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
dropout (Dropout)               (None, 64, 64, 256)  0           activation_1[0][0]               
__________________________________________________________________________________________________
conv2d_transpose_1 (Conv2DTrans (None, 128, 128, 128 131200      dropout[0][0]                    
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 128, 128, 256 0           conv2d_transpose_1[0][0]         
                                                                 block2_conv2[1][0]               
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 128, 128, 128 295040      concatenate_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 128, 128, 128 512         conv2d_2[0][0]                   
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 128, 128, 128 0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 128, 128, 128 147584      activation_2[0][0]               
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 128, 128, 128 512         conv2d_3[0][0]                   
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 128, 128, 128 0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 128, 128, 128 0           activation_3[0][0]               
__________________________________________________________________________________________________
conv2d_transpose_2 (Conv2DTrans (None, 64, 64, 256)  524544      block4_conv4[2][0]               
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 64, 64, 512)  0           conv2d_transpose_2[0][0]         
                                                                 block3_conv4[2][0]               
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 64, 64, 256)  1179904     concatenate_2[0][0]              
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 64, 64, 256)  1024        conv2d_4[0][0]                   
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 64, 64, 256)  0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 64, 64, 256)  590080      activation_4[0][0]               
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 64, 64, 256)  1024        conv2d_5[0][0]                   
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 64, 64, 256)  0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 64, 64, 256)  0           activation_5[0][0]               
__________________________________________________________________________________________________
conv2d_transpose_3 (Conv2DTrans (None, 128, 128, 128 131200      dropout_2[0][0]                  
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 128, 128, 256 0           conv2d_transpose_3[0][0]         
                                                                 dropout_1[0][0]                  
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 128, 128, 128 295040      concatenate_3[0][0]              
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 128, 128, 128 512         conv2d_6[0][0]                   
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 128, 128, 128 0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 128, 128, 128 147584      activation_6[0][0]               
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 128, 128, 128 512         conv2d_7[0][0]                   
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 128, 128, 128 0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 128, 128, 128 0           activation_7[0][0]               
__________________________________________________________________________________________________
conv2d_transpose_4 (Conv2DTrans (None, 256, 256, 64) 32832       dropout_3[0][0]                  
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 256, 256, 128 0           conv2d_transpose_4[0][0]         
                                                                 block1_conv2[1][0]               
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 256, 256, 64) 73792       concatenate_4[0][0]              
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 256, 256, 64) 256         conv2d_8[0][0]                   
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 256, 256, 64) 0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 256, 256, 64) 36928       activation_8[0][0]               
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 256, 256, 64) 256         conv2d_9[0][0]                   
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 256, 256, 64) 0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 256, 256, 64) 0           activation_9[0][0]               
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 256, 256, 64) 0           dropout_4[0][0]                  
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 256, 256, 1)  65          dropout_5[0][0]                  
==================================================================================================
Total params: 16,472,129
Trainable params: 16,468,801
Non-trainable params: 3,328
__________________________________________________________________________________________________