__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 256, 256, 3) 0                                            
__________________________________________________________________________________________________
unet3plus_down0_0 (Conv2D)      (None, 256, 256, 8)  216         input_2[0][0]                    
__________________________________________________________________________________________________
unet3plus_down0_0_bn (BatchNorm (None, 256, 256, 8)  32          unet3plus_down0_0[0][0]          
__________________________________________________________________________________________________
unet3plus_down0_0_activation (R (None, 256, 256, 8)  0           unet3plus_down0_0_bn[0][0]       
__________________________________________________________________________________________________
unet3plus_down0_1 (Conv2D)      (None, 256, 256, 8)  576         unet3plus_down0_0_activation[0][0
__________________________________________________________________________________________________
unet3plus_down0_1_bn (BatchNorm (None, 256, 256, 8)  32          unet3plus_down0_1[0][0]          
__________________________________________________________________________________________________
unet3plus_down0_1_activation (R (None, 256, 256, 8)  0           unet3plus_down0_1_bn[0][0]       
__________________________________________________________________________________________________
unet3plus_down1_encode_maxpool  (None, 128, 128, 8)  0           unet3plus_down0_1_activation[0][0
__________________________________________________________________________________________________
unet3plus_down1_conv_0 (Conv2D) (None, 128, 128, 16) 1152        unet3plus_down1_encode_maxpool[0]
__________________________________________________________________________________________________
unet3plus_down1_conv_0_bn (Batc (None, 128, 128, 16) 64          unet3plus_down1_conv_0[0][0]     
__________________________________________________________________________________________________
unet3plus_down1_conv_0_activati (None, 128, 128, 16) 0           unet3plus_down1_conv_0_bn[0][0]  
__________________________________________________________________________________________________
unet3plus_down1_conv_1 (Conv2D) (None, 128, 128, 16) 2304        unet3plus_down1_conv_0_activation
__________________________________________________________________________________________________
unet3plus_down1_conv_1_bn (Batc (None, 128, 128, 16) 64          unet3plus_down1_conv_1[0][0]     
__________________________________________________________________________________________________
unet3plus_down1_conv_1_activati (None, 128, 128, 16) 0           unet3plus_down1_conv_1_bn[0][0]  
__________________________________________________________________________________________________
unet3plus_down2_encode_maxpool  (None, 64, 64, 16)   0           unet3plus_down1_conv_1_activation
__________________________________________________________________________________________________
unet3plus_down2_conv_0 (Conv2D) (None, 64, 64, 32)   4608        unet3plus_down2_encode_maxpool[0]
__________________________________________________________________________________________________
unet3plus_down2_conv_0_bn (Batc (None, 64, 64, 32)   128         unet3plus_down2_conv_0[0][0]     
__________________________________________________________________________________________________
unet3plus_down2_conv_0_activati (None, 64, 64, 32)   0           unet3plus_down2_conv_0_bn[0][0]  
__________________________________________________________________________________________________
unet3plus_down2_conv_1 (Conv2D) (None, 64, 64, 32)   9216        unet3plus_down2_conv_0_activation
__________________________________________________________________________________________________
unet3plus_down2_conv_1_bn (Batc (None, 64, 64, 32)   128         unet3plus_down2_conv_1[0][0]     
__________________________________________________________________________________________________
unet3plus_down2_conv_1_activati (None, 64, 64, 32)   0           unet3plus_down2_conv_1_bn[0][0]  
__________________________________________________________________________________________________
unet3plus_down3_encode_maxpool  (None, 32, 32, 32)   0           unet3plus_down2_conv_1_activation
__________________________________________________________________________________________________
unet3plus_down3_conv_0 (Conv2D) (None, 32, 32, 64)   18432       unet3plus_down3_encode_maxpool[0]
__________________________________________________________________________________________________
unet3plus_down3_conv_0_bn (Batc (None, 32, 32, 64)   256         unet3plus_down3_conv_0[0][0]     
__________________________________________________________________________________________________
unet3plus_down3_conv_0_activati (None, 32, 32, 64)   0           unet3plus_down3_conv_0_bn[0][0]  
__________________________________________________________________________________________________
unet3plus_down3_conv_1 (Conv2D) (None, 32, 32, 64)   36864       unet3plus_down3_conv_0_activation
__________________________________________________________________________________________________
unet3plus_down3_conv_1_bn (Batc (None, 32, 32, 64)   256         unet3plus_down3_conv_1[0][0]     
__________________________________________________________________________________________________
unet3plus_down3_conv_1_activati (None, 32, 32, 64)   0           unet3plus_down3_conv_1_bn[0][0]  
__________________________________________________________________________________________________
unet3plus_down4_encode_maxpool  (None, 16, 16, 64)   0           unet3plus_down3_conv_1_activation
__________________________________________________________________________________________________
unet3plus_down4_conv_0 (Conv2D) (None, 16, 16, 128)  73728       unet3plus_down4_encode_maxpool[0]
__________________________________________________________________________________________________
unet3plus_down4_conv_0_bn (Batc (None, 16, 16, 128)  512         unet3plus_down4_conv_0[0][0]     
__________________________________________________________________________________________________
unet3plus_down4_conv_0_activati (None, 16, 16, 128)  0           unet3plus_down4_conv_0_bn[0][0]  
__________________________________________________________________________________________________
unet3plus_down4_conv_1 (Conv2D) (None, 16, 16, 128)  147456      unet3plus_down4_conv_0_activation
__________________________________________________________________________________________________
unet3plus_down4_conv_1_bn (Batc (None, 16, 16, 128)  512         unet3plus_down4_conv_1[0][0]     
__________________________________________________________________________________________________
unet3plus_down4_conv_1_activati (None, 16, 16, 128)  0           unet3plus_down4_conv_1_bn[0][0]  
__________________________________________________________________________________________________
unet3plus_down5_encode_maxpool  (None, 8, 8, 128)    0           unet3plus_down4_conv_1_activation
__________________________________________________________________________________________________
unet3plus_down5_conv_0 (Conv2D) (None, 8, 8, 256)    294912      unet3plus_down5_encode_maxpool[0]
__________________________________________________________________________________________________
unet3plus_down5_conv_0_bn (Batc (None, 8, 8, 256)    1024        unet3plus_down5_conv_0[0][0]     
__________________________________________________________________________________________________
unet3plus_down5_conv_0_activati (None, 8, 8, 256)    0           unet3plus_down5_conv_0_bn[0][0]  
__________________________________________________________________________________________________
unet3plus_down5_conv_1 (Conv2D) (None, 8, 8, 256)    589824      unet3plus_down5_conv_0_activation
__________________________________________________________________________________________________
unet3plus_down5_conv_1_bn (Batc (None, 8, 8, 256)    1024        unet3plus_down5_conv_1[0][0]     
__________________________________________________________________________________________________
unet3plus_down5_conv_1_activati (None, 8, 8, 256)    0           unet3plus_down5_conv_1_bn[0][0]  
__________________________________________________________________________________________________
unet3plus_up_0_en0_unpool (UpSa (None, 16, 16, 256)  0           unet3plus_down5_conv_1_activation
__________________________________________________________________________________________________
unet3plus_down_0_en2_maxpool (M (None, 16, 16, 64)   0           unet3plus_down3_conv_1_activation
__________________________________________________________________________________________________
unet3plus_down_0_en3_maxpool (M (None, 16, 16, 32)   0           unet3plus_down2_conv_1_activation
__________________________________________________________________________________________________
unet3plus_down_0_en4_maxpool (M (None, 16, 16, 16)   0           unet3plus_down1_conv_1_activation
__________________________________________________________________________________________________
unet3plus_down_from0_to0_0 (Con (None, 16, 16, 8)    18432       unet3plus_up_0_en0_unpool[0][0]  
__________________________________________________________________________________________________
unet3plus_down_from0_to1_0 (Con (None, 16, 16, 8)    9216        unet3plus_down4_conv_1_activation
__________________________________________________________________________________________________
unet3plus_down_from0_to2_0 (Con (None, 16, 16, 8)    4608        unet3plus_down_0_en2_maxpool[0][0
__________________________________________________________________________________________________
unet3plus_down_from0_to3_0 (Con (None, 16, 16, 8)    2304        unet3plus_down_0_en3_maxpool[0][0
__________________________________________________________________________________________________
unet3plus_down_from0_to4_0 (Con (None, 16, 16, 8)    1152        unet3plus_down_0_en4_maxpool[0][0
__________________________________________________________________________________________________
unet3plus_down_from0_to0_0_bn ( (None, 16, 16, 8)    32          unet3plus_down_from0_to0_0[0][0] 
__________________________________________________________________________________________________
unet3plus_down_from0_to1_0_bn ( (None, 16, 16, 8)    32          unet3plus_down_from0_to1_0[0][0] 
__________________________________________________________________________________________________
unet3plus_down_from0_to2_0_bn ( (None, 16, 16, 8)    32          unet3plus_down_from0_to2_0[0][0] 
__________________________________________________________________________________________________
unet3plus_down_from0_to3_0_bn ( (None, 16, 16, 8)    32          unet3plus_down_from0_to3_0[0][0] 
__________________________________________________________________________________________________
unet3plus_down_from0_to4_0_bn ( (None, 16, 16, 8)    32          unet3plus_down_from0_to4_0[0][0] 
__________________________________________________________________________________________________
unet3plus_down_from0_to0_0_acti (None, 16, 16, 8)    0           unet3plus_down_from0_to0_0_bn[0][
__________________________________________________________________________________________________
unet3plus_down_from0_to1_0_acti (None, 16, 16, 8)    0           unet3plus_down_from0_to1_0_bn[0][
__________________________________________________________________________________________________
unet3plus_down_from0_to2_0_acti (None, 16, 16, 8)    0           unet3plus_down_from0_to2_0_bn[0][
__________________________________________________________________________________________________
unet3plus_down_from0_to3_0_acti (None, 16, 16, 8)    0           unet3plus_down_from0_to3_0_bn[0][
__________________________________________________________________________________________________
unet3plus_down_from0_to4_0_acti (None, 16, 16, 8)    0           unet3plus_down_from0_to4_0_bn[0][
__________________________________________________________________________________________________
unet3plus_concat_0 (Concatenate (None, 16, 16, 40)   0           unet3plus_down_from0_to0_0_activa
                                                                 unet3plus_down_from0_to1_0_activa
                                                                 unet3plus_down_from0_to2_0_activa
                                                                 unet3plus_down_from0_to3_0_activa
                                                                 unet3plus_down_from0_to4_0_activa
__________________________________________________________________________________________________
unet3plus_fusion_conv_0_0 (Conv (None, 16, 16, 48)   17280       unet3plus_concat_0[0][0]         
__________________________________________________________________________________________________
unet3plus_fusion_conv_0_0_bn (B (None, 16, 16, 48)   192         unet3plus_fusion_conv_0_0[0][0]  
__________________________________________________________________________________________________
unet3plus_fusion_conv_0_0_activ (None, 16, 16, 48)   0           unet3plus_fusion_conv_0_0_bn[0][0
__________________________________________________________________________________________________
unet3plus_up_1_en0_unpool (UpSa (None, 32, 32, 256)  0           unet3plus_down5_conv_1_activation
__________________________________________________________________________________________________
unet3plus_up_1_en1_unpool (UpSa (None, 32, 32, 48)   0           unet3plus_fusion_conv_0_0_activat
__________________________________________________________________________________________________
unet3plus_down_1_en3_maxpool (M (None, 32, 32, 32)   0           unet3plus_down2_conv_1_activation
__________________________________________________________________________________________________
unet3plus_down_1_en4_maxpool (M (None, 32, 32, 16)   0           unet3plus_down1_conv_1_activation
__________________________________________________________________________________________________
unet3plus_down_from1_to0_0 (Con (None, 32, 32, 8)    18432       unet3plus_up_1_en0_unpool[0][0]  
__________________________________________________________________________________________________
unet3plus_down_from1_to1_0 (Con (None, 32, 32, 8)    3456        unet3plus_up_1_en1_unpool[0][0]  
__________________________________________________________________________________________________
unet3plus_down_from1_to2_0 (Con (None, 32, 32, 8)    4608        unet3plus_down3_conv_1_activation
__________________________________________________________________________________________________
unet3plus_down_from1_to3_0 (Con (None, 32, 32, 8)    2304        unet3plus_down_1_en3_maxpool[0][0
__________________________________________________________________________________________________
unet3plus_down_from1_to4_0 (Con (None, 32, 32, 8)    1152        unet3plus_down_1_en4_maxpool[0][0
__________________________________________________________________________________________________
unet3plus_down_from1_to0_0_bn ( (None, 32, 32, 8)    32          unet3plus_down_from1_to0_0[0][0] 
__________________________________________________________________________________________________
unet3plus_down_from1_to1_0_bn ( (None, 32, 32, 8)    32          unet3plus_down_from1_to1_0[0][0] 
__________________________________________________________________________________________________
unet3plus_down_from1_to2_0_bn ( (None, 32, 32, 8)    32          unet3plus_down_from1_to2_0[0][0] 
__________________________________________________________________________________________________
unet3plus_down_from1_to3_0_bn ( (None, 32, 32, 8)    32          unet3plus_down_from1_to3_0[0][0] 
__________________________________________________________________________________________________
unet3plus_down_from1_to4_0_bn ( (None, 32, 32, 8)    32          unet3plus_down_from1_to4_0[0][0] 
__________________________________________________________________________________________________
unet3plus_down_from1_to0_0_acti (None, 32, 32, 8)    0           unet3plus_down_from1_to0_0_bn[0][
__________________________________________________________________________________________________
unet3plus_down_from1_to1_0_acti (None, 32, 32, 8)    0           unet3plus_down_from1_to1_0_bn[0][
__________________________________________________________________________________________________
unet3plus_down_from1_to2_0_acti (None, 32, 32, 8)    0           unet3plus_down_from1_to2_0_bn[0][
__________________________________________________________________________________________________
unet3plus_down_from1_to3_0_acti (None, 32, 32, 8)    0           unet3plus_down_from1_to3_0_bn[0][
__________________________________________________________________________________________________
unet3plus_down_from1_to4_0_acti (None, 32, 32, 8)    0           unet3plus_down_from1_to4_0_bn[0][
__________________________________________________________________________________________________
unet3plus_concat_1 (Concatenate (None, 32, 32, 40)   0           unet3plus_down_from1_to0_0_activa
                                                                 unet3plus_down_from1_to1_0_activa
                                                                 unet3plus_down_from1_to2_0_activa
                                                                 unet3plus_down_from1_to3_0_activa
                                                                 unet3plus_down_from1_to4_0_activa
__________________________________________________________________________________________________
unet3plus_fusion_conv_1_0 (Conv (None, 32, 32, 48)   17280       unet3plus_concat_1[0][0]         
__________________________________________________________________________________________________
unet3plus_fusion_conv_1_0_bn (B (None, 32, 32, 48)   192         unet3plus_fusion_conv_1_0[0][0]  
__________________________________________________________________________________________________
unet3plus_fusion_conv_1_0_activ (None, 32, 32, 48)   0           unet3plus_fusion_conv_1_0_bn[0][0
__________________________________________________________________________________________________
unet3plus_up_2_en0_unpool (UpSa (None, 64, 64, 256)  0           unet3plus_down5_conv_1_activation
__________________________________________________________________________________________________
unet3plus_up_2_en1_unpool (UpSa (None, 64, 64, 48)   0           unet3plus_fusion_conv_0_0_activat
__________________________________________________________________________________________________
unet3plus_up_2_en2_unpool (UpSa (None, 64, 64, 48)   0           unet3plus_fusion_conv_1_0_activat
__________________________________________________________________________________________________
unet3plus_down_2_en4_maxpool (M (None, 64, 64, 16)   0           unet3plus_down1_conv_1_activation
__________________________________________________________________________________________________
unet3plus_down_from2_to0_0 (Con (None, 64, 64, 8)    18432       unet3plus_up_2_en0_unpool[0][0]  
__________________________________________________________________________________________________
unet3plus_down_from2_to1_0 (Con (None, 64, 64, 8)    3456        unet3plus_up_2_en1_unpool[0][0]  
__________________________________________________________________________________________________
unet3plus_down_from2_to2_0 (Con (None, 64, 64, 8)    3456        unet3plus_up_2_en2_unpool[0][0]  
__________________________________________________________________________________________________
unet3plus_down_from2_to3_0 (Con (None, 64, 64, 8)    2304        unet3plus_down2_conv_1_activation
__________________________________________________________________________________________________
unet3plus_down_from2_to4_0 (Con (None, 64, 64, 8)    1152        unet3plus_down_2_en4_maxpool[0][0
__________________________________________________________________________________________________
unet3plus_down_from2_to0_0_bn ( (None, 64, 64, 8)    32          unet3plus_down_from2_to0_0[0][0] 
__________________________________________________________________________________________________
unet3plus_down_from2_to1_0_bn ( (None, 64, 64, 8)    32          unet3plus_down_from2_to1_0[0][0] 
__________________________________________________________________________________________________
unet3plus_down_from2_to2_0_bn ( (None, 64, 64, 8)    32          unet3plus_down_from2_to2_0[0][0] 
__________________________________________________________________________________________________
unet3plus_down_from2_to3_0_bn ( (None, 64, 64, 8)    32          unet3plus_down_from2_to3_0[0][0] 
__________________________________________________________________________________________________
unet3plus_down_from2_to4_0_bn ( (None, 64, 64, 8)    32          unet3plus_down_from2_to4_0[0][0] 
__________________________________________________________________________________________________
unet3plus_down_from2_to0_0_acti (None, 64, 64, 8)    0           unet3plus_down_from2_to0_0_bn[0][
__________________________________________________________________________________________________
unet3plus_down_from2_to1_0_acti (None, 64, 64, 8)    0           unet3plus_down_from2_to1_0_bn[0][
__________________________________________________________________________________________________
unet3plus_down_from2_to2_0_acti (None, 64, 64, 8)    0           unet3plus_down_from2_to2_0_bn[0][
__________________________________________________________________________________________________
unet3plus_down_from2_to3_0_acti (None, 64, 64, 8)    0           unet3plus_down_from2_to3_0_bn[0][
__________________________________________________________________________________________________
unet3plus_down_from2_to4_0_acti (None, 64, 64, 8)    0           unet3plus_down_from2_to4_0_bn[0][
__________________________________________________________________________________________________
unet3plus_concat_2 (Concatenate (None, 64, 64, 40)   0           unet3plus_down_from2_to0_0_activa
                                                                 unet3plus_down_from2_to1_0_activa
                                                                 unet3plus_down_from2_to2_0_activa
                                                                 unet3plus_down_from2_to3_0_activa
                                                                 unet3plus_down_from2_to4_0_activa
__________________________________________________________________________________________________
unet3plus_fusion_conv_2_0 (Conv (None, 64, 64, 48)   17280       unet3plus_concat_2[0][0]         
__________________________________________________________________________________________________
unet3plus_fusion_conv_2_0_bn (B (None, 64, 64, 48)   192         unet3plus_fusion_conv_2_0[0][0]  
__________________________________________________________________________________________________
unet3plus_fusion_conv_2_0_activ (None, 64, 64, 48)   0           unet3plus_fusion_conv_2_0_bn[0][0
__________________________________________________________________________________________________
unet3plus_up_3_en0_unpool (UpSa (None, 128, 128, 256 0           unet3plus_down5_conv_1_activation
__________________________________________________________________________________________________
unet3plus_up_3_en1_unpool (UpSa (None, 128, 128, 48) 0           unet3plus_fusion_conv_0_0_activat
__________________________________________________________________________________________________
unet3plus_up_3_en2_unpool (UpSa (None, 128, 128, 48) 0           unet3plus_fusion_conv_1_0_activat
__________________________________________________________________________________________________
unet3plus_up_3_en3_unpool (UpSa (None, 128, 128, 48) 0           unet3plus_fusion_conv_2_0_activat
__________________________________________________________________________________________________
unet3plus_down_from3_to0_0 (Con (None, 128, 128, 8)  18432       unet3plus_up_3_en0_unpool[0][0]  
__________________________________________________________________________________________________
unet3plus_down_from3_to1_0 (Con (None, 128, 128, 8)  3456        unet3plus_up_3_en1_unpool[0][0]  
__________________________________________________________________________________________________
unet3plus_down_from3_to2_0 (Con (None, 128, 128, 8)  3456        unet3plus_up_3_en2_unpool[0][0]  
__________________________________________________________________________________________________
unet3plus_down_from3_to3_0 (Con (None, 128, 128, 8)  3456        unet3plus_up_3_en3_unpool[0][0]  
__________________________________________________________________________________________________
unet3plus_down_from3_to4_0 (Con (None, 128, 128, 8)  1152        unet3plus_down1_conv_1_activation
__________________________________________________________________________________________________
unet3plus_down_from3_to0_0_bn ( (None, 128, 128, 8)  32          unet3plus_down_from3_to0_0[0][0] 
__________________________________________________________________________________________________
unet3plus_down_from3_to1_0_bn ( (None, 128, 128, 8)  32          unet3plus_down_from3_to1_0[0][0] 
__________________________________________________________________________________________________
unet3plus_down_from3_to2_0_bn ( (None, 128, 128, 8)  32          unet3plus_down_from3_to2_0[0][0] 
__________________________________________________________________________________________________
unet3plus_down_from3_to3_0_bn ( (None, 128, 128, 8)  32          unet3plus_down_from3_to3_0[0][0] 
__________________________________________________________________________________________________
unet3plus_down_from3_to4_0_bn ( (None, 128, 128, 8)  32          unet3plus_down_from3_to4_0[0][0] 
__________________________________________________________________________________________________
unet3plus_down_from3_to0_0_acti (None, 128, 128, 8)  0           unet3plus_down_from3_to0_0_bn[0][
__________________________________________________________________________________________________
unet3plus_down_from3_to1_0_acti (None, 128, 128, 8)  0           unet3plus_down_from3_to1_0_bn[0][
__________________________________________________________________________________________________
unet3plus_down_from3_to2_0_acti (None, 128, 128, 8)  0           unet3plus_down_from3_to2_0_bn[0][
__________________________________________________________________________________________________
unet3plus_down_from3_to3_0_acti (None, 128, 128, 8)  0           unet3plus_down_from3_to3_0_bn[0][
__________________________________________________________________________________________________
unet3plus_down_from3_to4_0_acti (None, 128, 128, 8)  0           unet3plus_down_from3_to4_0_bn[0][
__________________________________________________________________________________________________
unet3plus_concat_3 (Concatenate (None, 128, 128, 40) 0           unet3plus_down_from3_to0_0_activa
                                                                 unet3plus_down_from3_to1_0_activa
                                                                 unet3plus_down_from3_to2_0_activa
                                                                 unet3plus_down_from3_to3_0_activa
                                                                 unet3plus_down_from3_to4_0_activa
__________________________________________________________________________________________________
unet3plus_fusion_conv_3_0 (Conv (None, 128, 128, 48) 17280       unet3plus_concat_3[0][0]         
__________________________________________________________________________________________________
unet3plus_fusion_conv_3_0_bn (B (None, 128, 128, 48) 192         unet3plus_fusion_conv_3_0[0][0]  
__________________________________________________________________________________________________
unet3plus_fusion_conv_3_0_activ (None, 128, 128, 48) 0           unet3plus_fusion_conv_3_0_bn[0][0
__________________________________________________________________________________________________
unet3plus_up_4_en0_unpool (UpSa (None, 256, 256, 256 0           unet3plus_down5_conv_1_activation
__________________________________________________________________________________________________
unet3plus_up_4_en1_unpool (UpSa (None, 256, 256, 48) 0           unet3plus_fusion_conv_0_0_activat
__________________________________________________________________________________________________
unet3plus_up_4_en2_unpool (UpSa (None, 256, 256, 48) 0           unet3plus_fusion_conv_1_0_activat
__________________________________________________________________________________________________
unet3plus_up_4_en3_unpool (UpSa (None, 256, 256, 48) 0           unet3plus_fusion_conv_2_0_activat
__________________________________________________________________________________________________
unet3plus_up_4_en4_unpool (UpSa (None, 256, 256, 48) 0           unet3plus_fusion_conv_3_0_activat
__________________________________________________________________________________________________
unet3plus_down_from4_to0_0 (Con (None, 256, 256, 8)  18432       unet3plus_up_4_en0_unpool[0][0]  
__________________________________________________________________________________________________
unet3plus_down_from4_to1_0 (Con (None, 256, 256, 8)  3456        unet3plus_up_4_en1_unpool[0][0]  
__________________________________________________________________________________________________
unet3plus_down_from4_to2_0 (Con (None, 256, 256, 8)  3456        unet3plus_up_4_en2_unpool[0][0]  
__________________________________________________________________________________________________
unet3plus_down_from4_to3_0 (Con (None, 256, 256, 8)  3456        unet3plus_up_4_en3_unpool[0][0]  
__________________________________________________________________________________________________
unet3plus_down_from4_to4_0 (Con (None, 256, 256, 8)  3456        unet3plus_up_4_en4_unpool[0][0]  
__________________________________________________________________________________________________
unet3plus_down_from4_to0_0_bn ( (None, 256, 256, 8)  32          unet3plus_down_from4_to0_0[0][0] 
__________________________________________________________________________________________________
unet3plus_down_from4_to1_0_bn ( (None, 256, 256, 8)  32          unet3plus_down_from4_to1_0[0][0] 
__________________________________________________________________________________________________
unet3plus_down_from4_to2_0_bn ( (None, 256, 256, 8)  32          unet3plus_down_from4_to2_0[0][0] 
__________________________________________________________________________________________________
unet3plus_down_from4_to3_0_bn ( (None, 256, 256, 8)  32          unet3plus_down_from4_to3_0[0][0] 
__________________________________________________________________________________________________
unet3plus_down_from4_to4_0_bn ( (None, 256, 256, 8)  32          unet3plus_down_from4_to4_0[0][0] 
__________________________________________________________________________________________________
unet3plus_down_from4_to0_0_acti (None, 256, 256, 8)  0           unet3plus_down_from4_to0_0_bn[0][
__________________________________________________________________________________________________
unet3plus_down_from4_to1_0_acti (None, 256, 256, 8)  0           unet3plus_down_from4_to1_0_bn[0][
__________________________________________________________________________________________________
unet3plus_down_from4_to2_0_acti (None, 256, 256, 8)  0           unet3plus_down_from4_to2_0_bn[0][
__________________________________________________________________________________________________
unet3plus_down_from4_to3_0_acti (None, 256, 256, 8)  0           unet3plus_down_from4_to3_0_bn[0][
__________________________________________________________________________________________________
unet3plus_down_from4_to4_0_acti (None, 256, 256, 8)  0           unet3plus_down_from4_to4_0_bn[0][
__________________________________________________________________________________________________
unet3plus_concat_4 (Concatenate (None, 256, 256, 40) 0           unet3plus_down_from4_to0_0_activa
                                                                 unet3plus_down_from4_to1_0_activa
                                                                 unet3plus_down_from4_to2_0_activa
                                                                 unet3plus_down_from4_to3_0_activa
                                                                 unet3plus_down_from4_to4_0_activa
__________________________________________________________________________________________________
unet3plus_fusion_conv_4_0 (Conv (None, 256, 256, 48) 17280       unet3plus_concat_4[0][0]         
__________________________________________________________________________________________________
unet3plus_fusion_conv_4_0_bn (B (None, 256, 256, 48) 192         unet3plus_fusion_conv_4_0[0][0]  
__________________________________________________________________________________________________
unet3plus_fusion_conv_4_0_activ (None, 256, 256, 48) 0           unet3plus_fusion_conv_4_0_bn[0][0
__________________________________________________________________________________________________
dropout (Dropout)               (None, 256, 256, 48) 0           unet3plus_fusion_conv_4_0_activat
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 256, 256, 1)  49          dropout[0][0]                    
==================================================================================================
Total params: 1,428,201
Trainable params: 1,425,305
Non-trainable params: 2,896
__________________________________________________________________________________________________